{
  "num_merges": 8192,
  "corpus_size": 1199970,
  "merges": [
    [
      "c",
      "c"
    ],
    [
      "C",
      "C"
    ],
    [
      "O",
      ")"
    ],
    [
      "c",
      "("
    ],
    [
      "C",
      "("
    ],
    [
      "c",
      "1"
    ],
    [
      "=",
      "O)"
    ],
    [
      "C",
      ")"
    ],
    [
      "c",
      "2"
    ],
    [
      "c",
      "3"
    ],
    [
      "cc",
      "cc"
    ],
    [
      "C(",
      "=O)"
    ],
    [
      ")",
      "cc"
    ],
    [
      "cc",
      "c("
    ],
    [
      "(",
      "C)"
    ],
    [
      "2",
      ")"
    ],
    [
      "cc",
      "("
    ],
    [
      "(",
      "=O)"
    ],
    [
      "C",
      "1"
    ],
    [
      "N",
      "("
    ],
    [
      "F",
      ")"
    ],
    [
      "CC",
      "CC"
    ],
    [
      "O",
      "C)"
    ],
    [
      "3",
      ")"
    ],
    [
      "1",
      ")"
    ],
    [
      "[C@H]",
      "("
    ],
    [
      "c",
      "4"
    ],
    [
      "[C@@H]",
      "("
    ],
    [
      "c",
      "n"
    ],
    [
      "C(",
      "C)"
    ],
    [
      "c2",
      ")"
    ],
    [
      "C(",
      "N"
    ],
    [
      "c1",
      "ccc("
    ],
    [
      "C(=O)",
      "N"
    ],
    [
      "C",
      "N"
    ],
    [
      "C",
      "2"
    ],
    [
      "c2",
      "c("
    ],
    [
      "c2",
      "cccc"
    ],
    [
      "n",
      "c("
    ],
    [
      "c1",
      "c("
    ],
    [
      "c1",
      "cccc"
    ],
    [
      "c2",
      "ccc("
    ],
    [
      "O",
      "CC"
    ],
    [
      "c1",
      ")"
    ],
    [
      "N",
      ")"
    ],
    [
      "C",
      "O"
    ],
    [
      "n",
      "1"
    ],
    [
      "C",
      "="
    ],
    [
      "c1",
      "cc("
    ],
    [
      "Cl",
      ")"
    ],
    [
      ")cc",
      "1"
    ],
    [
      "=",
      "O"
    ],
    [
      "c1",
      "("
    ],
    [
      "c3",
      ")"
    ],
    [
      "c3",
      "cccc"
    ],
    [
      "N",
      "C(=O)"
    ],
    [
      "c3",
      "c("
    ],
    [
      "CC",
      "N("
    ],
    [
      "S",
      "(=O)"
    ],
    [
      "CC",
      "("
    ],
    [
      "=O)",
      "cc"
    ],
    [
      "F",
      ")cc"
    ],
    [
      "n",
      "2"
    ],
    [
      "(",
      "F)"
    ],
    [
      "Cl",
      ")cc"
    ],
    [
      "c1",
      "cc"
    ],
    [
      "C)",
      "cc"
    ],
    [
      "C",
      "/"
    ],
    [
      "n",
      "("
    ],
    [
      "c3",
      "ccc("
    ],
    [
      "N",
      "1"
    ],
    [
      "4",
      ")"
    ],
    [
      "CC",
      "1"
    ],
    [
      "CC",
      ")"
    ],
    [
      "C(",
      "F)"
    ],
    [
      "c2",
      "cc"
    ],
    [
      "N",
      "C("
    ],
    [
      "O",
      "="
    ],
    [
      "C",
      "3"
    ],
    [
      "(C)",
      "C)"
    ],
    [
      "c2",
      "cc("
    ],
    [
      "OC)",
      "cc"
    ],
    [
      "c2cccc",
      "c2)"
    ],
    [
      "c(",
      "=O)"
    ],
    [
      "C(F)",
      "(F)"
    ],
    [
      "/",
      "C="
    ],
    [
      "N",
      "2"
    ],
    [
      "c2",
      "n"
    ],
    [
      "O",
      "C"
    ],
    [
      "CC",
      "(=O)"
    ],
    [
      "[C@H]",
      "1"
    ],
    [
      "C",
      "N("
    ],
    [
      "[C@@H]",
      "1"
    ],
    [
      "c1",
      "2"
    ],
    [
      "S(=O)",
      "(=O)"
    ],
    [
      "c(",
      "-"
    ],
    [
      "C(",
      "O)"
    ],
    [
      "CC",
      "2)"
    ],
    [
      "c1cccc",
      "c1"
    ],
    [
      "C(",
      "="
    ],
    [
      "C",
      "#"
    ],
    [
      "(",
      "O)"
    ],
    [
      "O)",
      "cc"
    ],
    [
      "CC",
      "2"
    ],
    [
      "CC",
      "C"
    ],
    [
      "c2cccc",
      "c2"
    ],
    [
      "[C@H]",
      "2"
    ],
    [
      "OC)",
      "c("
    ],
    [
      "c1",
      "n"
    ],
    [
      "CC",
      "N"
    ],
    [
      "c(",
      "C)"
    ],
    [
      "[C@@H]",
      "2"
    ],
    [
      "[C@H](",
      "O)"
    ],
    [
      "C(C)",
      "C)"
    ],
    [
      "c1cccc",
      "c1)"
    ],
    [
      "n",
      "2)"
    ],
    [
      "n",
      "cc"
    ],
    [
      "[O-]",
      ")"
    ],
    [
      "c3cccc",
      "c3)"
    ],
    [
      "c",
      "5"
    ],
    [
      "C",
      "2)"
    ],
    [
      "3",
      ")cc"
    ],
    [
      "[C@@H](",
      "O)"
    ],
    [
      "N",
      "="
    ],
    [
      "c3cccc",
      "c3"
    ],
    [
      "/C=",
      "C/"
    ],
    [
      "C",
      "O)"
    ],
    [
      "c3",
      "cc"
    ],
    [
      "nc(",
      "-"
    ],
    [
      "c(",
      "N"
    ],
    [
      "=",
      "N"
    ],
    [
      "S",
      "("
    ],
    [
      "c3",
      "cc("
    ],
    [
      "CC",
      "CN"
    ],
    [
      "c4",
      "cccc"
    ],
    [
      "2",
      ")cc"
    ],
    [
      "c1cccc",
      "("
    ],
    [
      "CC",
      "(C)"
    ],
    [
      "CC",
      "OCC"
    ],
    [
      "CC",
      "3)"
    ],
    [
      "C(N",
      ")"
    ],
    [
      "C1",
      ")"
    ],
    [
      "C(C)",
      "(C)"
    ],
    [
      "O",
      "C(=O)"
    ],
    [
      "c4",
      ")"
    ],
    [
      "n",
      "n"
    ],
    [
      "S(=O)",
      "("
    ],
    [
      "C(F)(F)",
      "F)"
    ],
    [
      "CC",
      "1)"
    ],
    [
      "cccc",
      "1"
    ],
    [
      "2",
      "c("
    ],
    [
      "[C@H]",
      "(C)"
    ],
    [
      "C(=O)",
      "O)"
    ],
    [
      "[C@@H]",
      "(C)"
    ],
    [
      "[C@H]",
      "3"
    ],
    [
      "2)",
      "=O)"
    ],
    [
      "OCC",
      ")"
    ],
    [
      "n",
      "c2"
    ],
    [
      "C#",
      "N)"
    ],
    [
      "nc(",
      "N"
    ],
    [
      "C",
      "c1ccc("
    ],
    [
      "c4",
      "c("
    ],
    [
      "CC",
      "C("
    ],
    [
      "C",
      "3)"
    ],
    [
      "CCCC",
      "CCCC"
    ],
    [
      "[C@@H]",
      "3"
    ],
    [
      "S",
      ")"
    ],
    [
      "(",
      "[O-])"
    ],
    [
      "O)",
      "c("
    ],
    [
      "=O)cc",
      "1"
    ],
    [
      ")cc",
      "("
    ],
    [
      "n",
      "c1"
    ],
    [
      "C",
      "[C@H]("
    ],
    [
      "[N+]",
      "(=O)"
    ],
    [
      "C",
      "S"
    ],
    [
      "n",
      "cn"
    ],
    [
      "c",
      "s"
    ],
    [
      "Cl)",
      "c("
    ],
    [
      "2",
      ")cc1"
    ],
    [
      "-",
      "c2"
    ],
    [
      "C",
      "\\"
    ],
    [
      "CC(=O)",
      "N"
    ],
    [
      "n",
      "3"
    ],
    [
      "=",
      "C("
    ],
    [
      "CC",
      "O"
    ],
    [
      "C(F)(F)",
      "F)cc"
    ],
    [
      "Br",
      ")"
    ],
    [
      "2)",
      "c1"
    ],
    [
      "N",
      "(C)"
    ],
    [
      "c4",
      "ccc("
    ],
    [
      "O=",
      "C("
    ],
    [
      "n",
      "(C)"
    ],
    [
      "C(O)",
      "=O)"
    ],
    [
      "(=O)",
      "=O)"
    ],
    [
      "C(C)",
      "(C)C)"
    ],
    [
      "C(=O)",
      "O"
    ],
    [
      "CN",
      "2"
    ],
    [
      "C",
      "[C@@H]("
    ],
    [
      "CN",
      "1"
    ],
    [
      "/",
      "C(="
    ],
    [
      ")cc",
      "c1"
    ],
    [
      "C(C)",
      "=O)"
    ],
    [
      "n(",
      "-"
    ],
    [
      "c1",
      "c2c("
    ],
    [
      "/",
      "N="
    ],
    [
      "C1",
      "("
    ],
    [
      "cccc",
      "3)"
    ],
    [
      "cccc",
      "2)"
    ],
    [
      "CC",
      "C)"
    ],
    [
      "5",
      ")"
    ],
    [
      "C",
      "4"
    ],
    [
      "C",
      "c2ccc("
    ],
    [
      "c1",
      "cn"
    ],
    [
      "C(=O)",
      "N("
    ],
    [
      "O",
      "C("
    ],
    [
      "c2cccc",
      "("
    ],
    [
      "[N+]",
      "([O-])"
    ],
    [
      "n",
      "1)"
    ],
    [
      ")cc",
      "2)"
    ],
    [
      ")cc",
      "1)"
    ],
    [
      "(C)",
      "CC"
    ],
    [
      "cc(",
      "-"
    ],
    [
      "N",
      "3"
    ],
    [
      "(C)",
      "cc"
    ],
    [
      "c",
      "[nH]"
    ],
    [
      "F)",
      "c("
    ],
    [
      "c1cc",
      "2c("
    ],
    [
      "3",
      "c("
    ],
    [
      ")cc",
      "3)"
    ],
    [
      ")cc",
      "c("
    ],
    [
      "C",
      "c2ccccc2)"
    ],
    [
      "C)cc",
      "1"
    ],
    [
      "c2",
      "c1"
    ],
    [
      "c12",
      "c("
    ],
    [
      "c3",
      "n"
    ],
    [
      "nc(",
      "C)"
    ],
    [
      "CC(",
      "N"
    ],
    [
      "O",
      "1"
    ],
    [
      "c1cc",
      "c2c("
    ],
    [
      "CC",
      "3"
    ],
    [
      "n",
      "3)"
    ],
    [
      "-",
      "c2ccc("
    ],
    [
      "OC)c(",
      "OC)"
    ],
    [
      "=O)",
      "c1"
    ],
    [
      "N",
      "/"
    ],
    [
      "C#",
      "N"
    ],
    [
      "CC",
      "(C)C)"
    ],
    [
      "O",
      "CO"
    ],
    [
      "CO",
      "c1ccc("
    ],
    [
      "cccc",
      "2"
    ],
    [
      "(",
      "N"
    ],
    [
      "[C@]",
      "2"
    ],
    [
      "CC",
      "N1"
    ],
    [
      "c",
      "o"
    ],
    [
      "[C@]",
      "1"
    ],
    [
      "CC",
      "C1"
    ],
    [
      "O=",
      "C(N"
    ],
    [
      "O",
      "("
    ],
    [
      "[C@@]",
      "2"
    ],
    [
      "(C)",
      "C"
    ],
    [
      "C)",
      "=O)"
    ],
    [
      "c1cccc",
      "2"
    ],
    [
      "c4cccc",
      "c4"
    ],
    [
      "C(=O)N",
      "2"
    ],
    [
      "c2",
      "cn"
    ],
    [
      "cccc",
      "c1"
    ],
    [
      "C",
      "c1ccccc1)"
    ],
    [
      "(C)",
      "("
    ],
    [
      "CN",
      "C(=O)"
    ],
    [
      "n",
      "c3"
    ],
    [
      "Cl",
      ")cc1"
    ],
    [
      "[C@@]",
      "1"
    ],
    [
      "C(=O)N",
      "1"
    ],
    [
      "c(",
      "N)"
    ],
    [
      "N1",
      "("
    ],
    [
      "c1c(",
      "C)"
    ],
    [
      "C",
      "n1"
    ],
    [
      "CC(",
      "O)"
    ],
    [
      "C1",
      "=O"
    ],
    [
      "c2ccc(",
      "Cl)cc"
    ],
    [
      "F",
      ")cc1"
    ],
    [
      "c4cccc",
      "c4)"
    ],
    [
      "c1",
      "-"
    ],
    [
      ")cc",
      "2"
    ],
    [
      "=O)",
      "=O)"
    ],
    [
      "CCCC",
      ")"
    ],
    [
      "OC)",
      "c1"
    ],
    [
      "1)",
      "=O"
    ],
    [
      "CO",
      "C(=O)"
    ],
    [
      "[N+](=O)",
      "[O-]"
    ],
    [
      "C(",
      "OC)"
    ],
    [
      "CC",
      "C2"
    ],
    [
      "C",
      "c1"
    ],
    [
      "CC",
      "="
    ],
    [
      "C1",
      "N("
    ],
    [
      "c2",
      "s"
    ],
    [
      "C/",
      "C="
    ],
    [
      "O",
      "[C@H]("
    ],
    [
      "Cl)cc",
      "("
    ],
    [
      "nc(",
      "N)"
    ],
    [
      "cc",
      "1"
    ],
    [
      "Cl)",
      "c1"
    ],
    [
      "C",
      "n2"
    ],
    [
      "C1",
      "="
    ],
    [
      "OC)",
      "cc("
    ],
    [
      "cc",
      "1)"
    ],
    [
      "C)cc",
      "2)"
    ],
    [
      "c(",
      "O)"
    ],
    [
      "N2",
      "CCN("
    ],
    [
      "o",
      "1"
    ],
    [
      "[C@]",
      "3"
    ],
    [
      "=O)cc",
      "c1"
    ],
    [
      "C1",
      "CCCC"
    ],
    [
      "OC)cc",
      "1"
    ],
    [
      "cccc",
      "1)"
    ],
    [
      "-",
      "c2n"
    ],
    [
      "c2)",
      "=O)"
    ],
    [
      "s",
      "1"
    ],
    [
      "c4",
      "cc"
    ],
    [
      "=",
      "S)"
    ],
    [
      "C(",
      "O"
    ],
    [
      "[N+](=O)",
      "[O-])"
    ],
    [
      "3)",
      "=O)"
    ],
    [
      "c(=O)",
      "[nH]"
    ],
    [
      "[C@H]",
      "4"
    ],
    [
      "c3",
      "cn"
    ],
    [
      "c2c(",
      "C)"
    ],
    [
      "CC",
      "C(N"
    ],
    [
      "F)cc",
      "2)"
    ],
    [
      "c1cc",
      "2"
    ],
    [
      "o",
      "c("
    ],
    [
      "c2",
      "c3c("
    ],
    [
      "[C@@]",
      "3"
    ],
    [
      "N",
      "C(=O)N"
    ],
    [
      "C(",
      "/"
    ],
    [
      "N(",
      "C(=O)"
    ],
    [
      "CC",
      "4)"
    ],
    [
      "CCN",
      "(C)"
    ],
    [
      "c2cc",
      "3c("
    ],
    [
      "c3ccc(",
      "Cl)cc"
    ],
    [
      "CCCC",
      "C2)"
    ],
    [
      "CN",
      "(C)"
    ],
    [
      "cn",
      "1"
    ],
    [
      "C(=O)N",
      "[C@@H]("
    ],
    [
      "C2",
      "=O)"
    ],
    [
      "N",
      "C"
    ],
    [
      "c1",
      "s"
    ],
    [
      "n(",
      "C"
    ],
    [
      "[C@@H]",
      "4"
    ],
    [
      "C",
      "4)"
    ],
    [
      "O)cc",
      "1"
    ],
    [
      "c3ccc(",
      "F)cc"
    ],
    [
      "3)cc",
      "2)"
    ],
    [
      "OC)cc",
      "2)"
    ],
    [
      "-",
      "n2"
    ],
    [
      "c1ccc2c(",
      "c1)"
    ],
    [
      "c3cccc",
      "("
    ],
    [
      "CC(C)",
      "(C)"
    ],
    [
      "O=",
      "C1"
    ],
    [
      "c2)",
      "c1"
    ],
    [
      "C(N)",
      "=O)"
    ],
    [
      "C",
      "[C@@H]1"
    ],
    [
      "C",
      "c1cc("
    ],
    [
      "N(",
      "C("
    ],
    [
      "c4",
      "cc("
    ],
    [
      "C",
      "[C@H]1"
    ],
    [
      "(",
      "O"
    ],
    [
      "c2",
      "[nH]"
    ],
    [
      "CCN(",
      "C(=O)"
    ],
    [
      "C1",
      "CN("
    ],
    [
      "CN",
      "C("
    ],
    [
      "=O)cc",
      "2)"
    ],
    [
      "c2cc",
      "c3c("
    ],
    [
      "1)",
      "=O)"
    ],
    [
      "CC",
      "[C@H]("
    ],
    [
      "[C@@H](",
      "O"
    ],
    [
      "/N=",
      "C/"
    ],
    [
      "c2",
      ")cc1"
    ],
    [
      "CCN(",
      "C"
    ],
    [
      "(",
      "C"
    ],
    [
      "C(N",
      "1"
    ],
    [
      "n1",
      "c("
    ],
    [
      "(C)",
      "c("
    ],
    [
      "C2",
      "=O"
    ],
    [
      "c1",
      "nc("
    ],
    [
      "C2",
      "("
    ],
    [
      "C(N",
      "2"
    ],
    [
      "C",
      "c1c("
    ],
    [
      "C",
      "[C@H]2"
    ],
    [
      "=",
      "N)"
    ],
    [
      "c2",
      "nc("
    ],
    [
      "S(=O)(=O)",
      "N"
    ],
    [
      "-",
      "c2c("
    ],
    [
      "CN",
      "3"
    ],
    [
      "CC",
      "4"
    ],
    [
      "C(C)",
      "="
    ],
    [
      "(=O)",
      "N"
    ],
    [
      "=O)",
      "c("
    ],
    [
      "C(",
      "OCC)"
    ],
    [
      "c3c(",
      "cccc3)"
    ],
    [
      "C",
      "[C@@H]2"
    ],
    [
      "C(=O)",
      "OC)"
    ],
    [
      "/C=",
      "N/"
    ],
    [
      "2)cc",
      "c1"
    ],
    [
      "C(",
      "\\"
    ],
    [
      "cccc",
      "3"
    ],
    [
      "c2ccc(",
      "-"
    ],
    [
      "C",
      "OCC"
    ],
    [
      "C)cc",
      "3)"
    ],
    [
      "C2",
      "="
    ],
    [
      "[C@H](",
      "O"
    ],
    [
      "CC",
      "CN("
    ],
    [
      "o",
      "cc"
    ],
    [
      "[nH]",
      "1"
    ],
    [
      "C1",
      "2"
    ],
    [
      "c",
      "6"
    ],
    [
      "C",
      "c2c("
    ],
    [
      "C",
      "c1ccccc1"
    ],
    [
      "-",
      "c2cc("
    ],
    [
      "n2",
      ")cc1"
    ],
    [
      "cc",
      "2)"
    ],
    [
      "P",
      "(=O)"
    ],
    [
      "NC(=O)",
      "[C@H]("
    ],
    [
      "CCCC",
      "1"
    ],
    [
      "C(=O)N",
      ")"
    ],
    [
      "c2ccc(Cl)cc",
      "2)"
    ],
    [
      "N",
      "C(N"
    ],
    [
      "c1)",
      "=O"
    ],
    [
      "[C@@H](",
      "CO)"
    ],
    [
      "cccc",
      "4)"
    ],
    [
      "n",
      "o"
    ],
    [
      "[C@@H](O)",
      "[C@H](O)"
    ],
    [
      "C(=",
      "N)"
    ],
    [
      "4",
      "c("
    ],
    [
      "C(",
      "c1ccc("
    ],
    [
      "N(",
      "CC)"
    ],
    [
      "CC",
      "O)"
    ],
    [
      "n",
      "n1"
    ],
    [
      "ncc",
      "1"
    ],
    [
      "c5",
      "cccc"
    ],
    [
      "O",
      "2)"
    ],
    [
      "CC",
      "N2"
    ],
    [
      "CC",
      "S"
    ],
    [
      "CC",
      "CO"
    ],
    [
      "c3ccc(",
      "OC)cc"
    ],
    [
      "C(=O)N",
      "[C@H]("
    ],
    [
      "F)cc",
      "("
    ],
    [
      "[N+]([O-])",
      "=O)"
    ],
    [
      "C",
      "c1cc"
    ],
    [
      "C)cc",
      "1)"
    ],
    [
      "C(OC)",
      "=O)"
    ],
    [
      "c2c(",
      "cccc2)"
    ],
    [
      "c(",
      "F)"
    ],
    [
      "cn",
      "2)"
    ],
    [
      "c2cc",
      "1"
    ],
    [
      "=O)cc",
      "1)"
    ],
    [
      "CCN(",
      "C("
    ],
    [
      "c3ccc(F)cc",
      "3)"
    ],
    [
      "c2",
      "n("
    ],
    [
      "CC(=O)",
      "O)"
    ],
    [
      "C1",
      "=O)"
    ],
    [
      "C1",
      "(=O)"
    ],
    [
      "c2",
      "1"
    ],
    [
      "OC)",
      "ccc("
    ],
    [
      "c1cc2c(",
      "cc1)"
    ],
    [
      "4",
      ")cc"
    ],
    [
      "C",
      "c3ccccc3)"
    ],
    [
      "CC",
      "C3"
    ],
    [
      "N",
      "(C)C)"
    ],
    [
      "S",
      "(C)"
    ],
    [
      "CCCC",
      "2)"
    ],
    [
      "Cl)cc",
      "1)"
    ],
    [
      "cn",
      "c1"
    ],
    [
      "Br",
      ")cc"
    ],
    [
      "s",
      "c("
    ],
    [
      "C(=",
      "S)"
    ],
    [
      "OC(=O)",
      "C)"
    ],
    [
      "CC2",
      ")cc1"
    ],
    [
      "c3ccc(Cl)cc",
      "3)"
    ],
    [
      "CO",
      "c1cc("
    ],
    [
      "c1",
      "(C)"
    ],
    [
      "n2)",
      "c1"
    ],
    [
      "O)cc",
      "2)"
    ],
    [
      "/C(=",
      "C/"
    ],
    [
      "O)",
      "cc("
    ],
    [
      "OC)c(",
      "OC)c(OC)"
    ],
    [
      "CCCC",
      "C3)"
    ],
    [
      "N",
      "S(=O)(=O)"
    ],
    [
      "c2",
      "3)"
    ],
    [
      "CCCN",
      "1"
    ],
    [
      "C)",
      "c("
    ],
    [
      "cc",
      "2"
    ],
    [
      "C",
      "c1n"
    ],
    [
      "o",
      "c(-"
    ],
    [
      "C)",
      "c1"
    ],
    [
      "c5",
      ")"
    ],
    [
      "[C@]",
      "(C)("
    ],
    [
      "O",
      "2"
    ],
    [
      "cn",
      "c3"
    ],
    [
      "[C@]",
      "4"
    ],
    [
      "nc(",
      "S"
    ],
    [
      "cc",
      "c1)"
    ],
    [
      "(",
      "CC)"
    ],
    [
      "[C@@]",
      "(C)("
    ],
    [
      "c(C)",
      "c1"
    ],
    [
      "Cl)",
      "c2)"
    ],
    [
      "OC)c(",
      "OC)cc"
    ],
    [
      "O",
      "CCCC"
    ],
    [
      "c1",
      "[nH]"
    ],
    [
      "C1",
      "C("
    ],
    [
      "C(=O)",
      "OCC)"
    ],
    [
      "c2ccc(",
      "F)cc2)"
    ],
    [
      "[C@H]1",
      "O"
    ],
    [
      "c2cc",
      "3"
    ],
    [
      "=O)cc",
      "2"
    ],
    [
      "C(=O)",
      "OCC"
    ],
    [
      "c5",
      "c("
    ],
    [
      "cn",
      "2"
    ],
    [
      "n",
      "[nH]"
    ],
    [
      "O",
      "3)"
    ],
    [
      "(",
      "CC"
    ],
    [
      "CCCC",
      "3)"
    ],
    [
      "C(",
      "CC)"
    ],
    [
      "[C@@H](",
      "NC(=O)"
    ],
    [
      "(=O)",
      "=O"
    ],
    [
      "cc",
      "c1"
    ],
    [
      "C2",
      "=N"
    ],
    [
      "2)cc",
      "("
    ],
    [
      "2)cc",
      "c("
    ],
    [
      "C(C)",
      "C"
    ],
    [
      "c2",
      "nc(-"
    ],
    [
      "CCOCC",
      "2)"
    ],
    [
      "c2ccc3c(",
      "c2)"
    ],
    [
      "C",
      "[C@H](O)"
    ],
    [
      "n",
      "c2)"
    ],
    [
      "CC",
      "NC(=O)"
    ],
    [
      "s",
      "2)"
    ],
    [
      "c2",
      "=O)"
    ],
    [
      "CCC",
      "2)"
    ],
    [
      "[C@]2",
      "(C)"
    ],
    [
      "c3",
      "[nH]"
    ],
    [
      "c(=O)",
      "n("
    ],
    [
      "N)",
      "=O)"
    ],
    [
      "c2cc(",
      "-"
    ],
    [
      "n",
      "4"
    ],
    [
      "C(OCC)",
      "=O)"
    ],
    [
      "c(C)",
      "c("
    ],
    [
      "-",
      "c1ccc("
    ],
    [
      "N(",
      "C"
    ],
    [
      "-",
      "c2ccccc2"
    ],
    [
      "n2",
      "c("
    ],
    [
      "N1",
      "CCN("
    ],
    [
      "C(=O)",
      "("
    ],
    [
      "CCOCC",
      "3)"
    ],
    [
      "c1(",
      "N"
    ],
    [
      "[C@@]",
      "4"
    ],
    [
      "O)",
      "c1"
    ],
    [
      "CC",
      "[C@@H]("
    ],
    [
      "3",
      ")cc1"
    ],
    [
      "CC2)",
      "c1"
    ],
    [
      "c(=O)",
      "c("
    ],
    [
      "N",
      "\\"
    ],
    [
      "Cl)cc",
      "2)"
    ],
    [
      "c2ccc(",
      "OC)cc2)"
    ],
    [
      "CO",
      "C("
    ],
    [
      "N",
      "c1ccc("
    ],
    [
      "cccc",
      "("
    ],
    [
      "CC2)",
      "=O)"
    ],
    [
      "c",
      "-"
    ],
    [
      "O)cc",
      "1)"
    ],
    [
      "c2cc",
      "cn"
    ],
    [
      "c(",
      "S"
    ],
    [
      "c3)",
      "=O)"
    ],
    [
      "C(N",
      "[C@H]("
    ],
    [
      "[C@]1",
      "2"
    ],
    [
      "n",
      "n2"
    ],
    [
      "N",
      "4"
    ],
    [
      "C(=O)N",
      "3"
    ],
    [
      "C3",
      "=O)"
    ],
    [
      "F)cc",
      "1)"
    ],
    [
      "=O)cc",
      "3)"
    ],
    [
      "P",
      "(O)"
    ],
    [
      "C(C)",
      "("
    ],
    [
      "[C@@]2",
      "(C)"
    ],
    [
      "c3ccc(OC)cc",
      "3)"
    ],
    [
      "c3c(",
      "C)"
    ],
    [
      "C(",
      "CC"
    ],
    [
      "-",
      "c2ccccc2)"
    ],
    [
      "[C@@H](",
      "NC("
    ],
    [
      "C(=",
      "C)"
    ],
    [
      "cn",
      "("
    ],
    [
      "C)cc",
      "2"
    ],
    [
      "n",
      "cc("
    ],
    [
      "c3",
      "s"
    ],
    [
      "c1)",
      "=O)"
    ],
    [
      "n1",
      "("
    ],
    [
      "n",
      "n2)"
    ],
    [
      "O",
      "c1ccc("
    ],
    [
      "O[C@H](",
      "CO)"
    ],
    [
      "O=",
      "C(O)"
    ],
    [
      "c1",
      "=O"
    ],
    [
      "N2",
      "C(=O)"
    ],
    [
      "C",
      "[C@@H](O)"
    ],
    [
      "[C@@H]1",
      "O"
    ],
    [
      "CN",
      ")"
    ],
    [
      "C(N",
      "[C@@H]("
    ],
    [
      "CCN(",
      "CC)"
    ],
    [
      "CN(",
      "C(=O)"
    ],
    [
      "N(",
      "CC"
    ],
    [
      "CCCC",
      "CC"
    ],
    [
      "OC)cc",
      "1)"
    ],
    [
      "Cl)cc",
      "c1"
    ],
    [
      "3)cc",
      "2"
    ],
    [
      "cn",
      "3)"
    ],
    [
      "c2c(",
      "cc("
    ],
    [
      "C",
      "c2"
    ],
    [
      "C(",
      "c2ccccc2)"
    ],
    [
      "[C@]",
      "("
    ],
    [
      "[C@@]",
      "("
    ],
    [
      "C",
      "c2cc("
    ],
    [
      "C/C=",
      "C/"
    ],
    [
      "cc",
      "c2)"
    ],
    [
      "CCCN",
      "2"
    ],
    [
      "O",
      "(C)"
    ],
    [
      "C)cc",
      "c1"
    ],
    [
      "s",
      "c1"
    ],
    [
      "c3ccc(",
      "-"
    ],
    [
      "S(",
      "N"
    ],
    [
      "O",
      "C1"
    ],
    [
      "C",
      "[C@H]3"
    ],
    [
      "C(=O)",
      "OC"
    ],
    [
      "c3cc",
      "4c("
    ],
    [
      "c2",
      "n1"
    ],
    [
      "=N",
      "/"
    ],
    [
      "c2cc",
      "ncc"
    ],
    [
      "C",
      "[C@@H](C)"
    ],
    [
      "CCCC",
      "2"
    ],
    [
      "CC",
      "OC(=O)"
    ],
    [
      "CCC",
      "3)"
    ],
    [
      "CC(O)",
      "=O)"
    ],
    [
      "C(=O)N",
      "(C)"
    ],
    [
      "O",
      "[C@@H]("
    ],
    [
      "S(=O)",
      "(C)"
    ],
    [
      "c1c(",
      "N"
    ],
    [
      "Cl)cc",
      "c("
    ],
    [
      "c3",
      "c4c("
    ],
    [
      "O)",
      "=O)"
    ],
    [
      "c2",
      "nc(N"
    ],
    [
      "S(=O)(",
      "N"
    ],
    [
      "CC",
      "C1)"
    ],
    [
      "=O)",
      "[nH]"
    ],
    [
      "C(",
      "c1ccccc1)"
    ],
    [
      "(C)",
      "c1"
    ],
    [
      "c1ccc(",
      "N"
    ],
    [
      "CCCC",
      "C1"
    ],
    [
      "O",
      "[C@H]1"
    ],
    [
      "C2",
      ")cc1"
    ],
    [
      "O",
      "c2ccc("
    ],
    [
      "C",
      "5"
    ],
    [
      "2)cc",
      "1)"
    ],
    [
      "/C=",
      "C2"
    ],
    [
      "c2ccccc2",
      "1"
    ],
    [
      "C3",
      "CC3)"
    ],
    [
      "c2cc3c(",
      "cc2)"
    ],
    [
      "C1",
      "CCN("
    ],
    [
      "c5",
      "ccc("
    ],
    [
      "N",
      "#"
    ],
    [
      "c3",
      "n("
    ],
    [
      "c2n",
      "cc"
    ],
    [
      "O",
      "[C@@H]1"
    ],
    [
      "6",
      ")"
    ],
    [
      "C2",
      "CC2)"
    ],
    [
      "=",
      "C\\"
    ],
    [
      "C(",
      "C"
    ],
    [
      "C(=O)N",
      "CC"
    ],
    [
      "/C(=",
      "C\\"
    ],
    [
      "c1ccc(",
      "Cl)cc1"
    ],
    [
      "[C@]3",
      "(C)"
    ],
    [
      "C2",
      "CCCCC2)"
    ],
    [
      "C#N",
      ")cc"
    ],
    [
      "[n+]",
      "1"
    ],
    [
      "S",
      "1"
    ],
    [
      "C(=O)N",
      "C"
    ],
    [
      "N1",
      "C(=O)"
    ],
    [
      "/C(=",
      "N/"
    ],
    [
      "O)cc",
      "3)"
    ],
    [
      "C(",
      "C("
    ],
    [
      "C",
      "[C@@H]3"
    ],
    [
      "O",
      "C2"
    ],
    [
      "c3c(",
      "cc("
    ],
    [
      "C(C)(C)C)",
      "=O)"
    ],
    [
      "N=",
      "C("
    ],
    [
      "Cl)",
      "c3)"
    ],
    [
      "c1",
      "n("
    ],
    [
      "s",
      "1)"
    ],
    [
      "P(=O)",
      "(O)"
    ],
    [
      "c2ccc(",
      "C)cc2)"
    ],
    [
      "c1",
      "(=O)"
    ],
    [
      "c1",
      "nc(-"
    ],
    [
      "c2",
      "C)"
    ],
    [
      "4",
      ")cc3)"
    ],
    [
      "c2cccc",
      "3"
    ],
    [
      "O",
      "C(C)"
    ],
    [
      "O)",
      "ccc("
    ],
    [
      "O",
      "1)"
    ],
    [
      "c(=O)",
      "n(C)"
    ],
    [
      "CO",
      "c1c("
    ],
    [
      "OC)",
      "=O)"
    ],
    [
      "CC",
      "#"
    ],
    [
      "CC)",
      "=O)"
    ],
    [
      "C(N)",
      "=N"
    ],
    [
      "[C@@]1",
      "2"
    ],
    [
      "cc",
      "3)"
    ],
    [
      "CCOCC",
      "1"
    ],
    [
      "NC(",
      "=S)"
    ],
    [
      "=",
      "C1"
    ],
    [
      "c3",
      ")cc"
    ],
    [
      "C1",
      "CC("
    ],
    [
      "O=",
      "S("
    ],
    [
      "[C@@H](",
      "N)"
    ],
    [
      "c2",
      "o"
    ],
    [
      "C(",
      "N("
    ],
    [
      "(",
      "C(F)(F)F)"
    ],
    [
      "CCN",
      "(C)C)"
    ],
    [
      "CC=",
      "C)"
    ],
    [
      "n",
      "c3)"
    ],
    [
      "C/C=",
      "C\\"
    ],
    [
      "OCC",
      "("
    ],
    [
      "n",
      "4)"
    ],
    [
      "c3ccc(",
      "C)cc3)"
    ],
    [
      "cc",
      "3"
    ],
    [
      "C(",
      "CCCC"
    ],
    [
      "-c2",
      "cn"
    ],
    [
      "cn",
      "1)"
    ],
    [
      "OCO",
      "2"
    ],
    [
      "O",
      "C(C)(C)"
    ],
    [
      "c(",
      "OC)"
    ],
    [
      "N",
      "c1n"
    ],
    [
      "/C=",
      "C\\"
    ],
    [
      "=",
      "C2"
    ],
    [
      "C",
      "c2ccccc2"
    ],
    [
      "c2cc(",
      "Cl)cc"
    ],
    [
      "c2cccc",
      "c12"
    ],
    [
      "(O)",
      "("
    ],
    [
      "CCCC",
      "C1)"
    ],
    [
      "ncc",
      "2"
    ],
    [
      "O)cc",
      "2"
    ],
    [
      "CC",
      "3)cc"
    ],
    [
      "[nH]",
      "c("
    ],
    [
      "c3",
      "c2"
    ],
    [
      "c2c(",
      "-"
    ],
    [
      "OC)cc",
      "2"
    ],
    [
      "c(",
      "Cl)"
    ],
    [
      "C/",
      "C(="
    ],
    [
      "c2ccccc2)",
      "=O)"
    ],
    [
      "[C@@]3",
      "(C)"
    ],
    [
      "F)",
      "c1"
    ],
    [
      "c(N",
      "3"
    ],
    [
      "C(N",
      "C("
    ],
    [
      "C1",
      "=N"
    ],
    [
      "CC",
      "C(C)"
    ],
    [
      "c2c(",
      "=O)"
    ],
    [
      "CCCC",
      "("
    ],
    [
      "[C@@H]",
      "5"
    ],
    [
      "CCN",
      "3"
    ],
    [
      "o",
      "2)"
    ],
    [
      "c2ccc(",
      "F)cc"
    ],
    [
      "CC",
      "[C@H]2"
    ],
    [
      "n",
      "c1)"
    ],
    [
      "CC1",
      "(C)"
    ],
    [
      "c2n",
      "c3c("
    ],
    [
      "C)",
      "=O"
    ],
    [
      "OCC",
      "(=O)"
    ],
    [
      "(F)",
      "F"
    ],
    [
      "c2c(",
      "ccc("
    ],
    [
      "[C@H]",
      "5"
    ],
    [
      "CC",
      "C(=O)N"
    ],
    [
      "c1cc2c(",
      "cc1"
    ],
    [
      "[C@@H]1",
      "2"
    ],
    [
      "c3cc",
      "c4c("
    ],
    [
      "C(C)C)",
      "=O)"
    ],
    [
      "c3",
      "ncn"
    ],
    [
      "C",
      "c1cccc("
    ],
    [
      "n",
      "c4"
    ],
    [
      ")cc",
      "3"
    ],
    [
      "[C@H](O)",
      "[C@H](O)"
    ],
    [
      "C(\\",
      "C)"
    ],
    [
      "C(N",
      "C(=O)"
    ],
    [
      "C",
      "[C@H](C)"
    ],
    [
      "c3",
      "nc("
    ],
    [
      "[N+]",
      "("
    ],
    [
      "(=O)",
      "=O)cc"
    ],
    [
      "[C@]1",
      "(C)"
    ],
    [
      "[n+]",
      "("
    ],
    [
      "n3",
      "c("
    ],
    [
      "c1",
      "C"
    ],
    [
      "O",
      "c1c("
    ],
    [
      "c4",
      "cn"
    ],
    [
      "CC1)",
      "=O"
    ],
    [
      "C",
      "S(=O)(=O)"
    ],
    [
      "c2",
      ")ccc1"
    ],
    [
      "OCO",
      "3)"
    ],
    [
      "ncc",
      "3)"
    ],
    [
      "/",
      "C("
    ],
    [
      "c2n",
      "cn"
    ],
    [
      "-",
      "c1c("
    ],
    [
      "c2c(",
      "c1)"
    ],
    [
      "[C@]2",
      "("
    ],
    [
      "CN(",
      "C"
    ],
    [
      "CCCCCCCC",
      "CCCC"
    ],
    [
      "c1cc(",
      "N"
    ],
    [
      "I",
      ")"
    ],
    [
      "S(C)",
      "(=O)=O)"
    ],
    [
      "c2cc",
      "co"
    ],
    [
      "OC)cc",
      "c1"
    ],
    [
      "O)c(",
      "O)"
    ],
    [
      "c4",
      "n"
    ],
    [
      "c2)",
      "CC1"
    ],
    [
      "c5cccc",
      "c5"
    ],
    [
      "C(F)(F)",
      "F"
    ],
    [
      "n1",
      "c(-"
    ],
    [
      "CC",
      "NC("
    ],
    [
      "C2",
      "=C("
    ],
    [
      ")cc",
      "4)"
    ],
    [
      "O",
      "C(F)(F)F)cc"
    ],
    [
      "n1",
      "cc("
    ],
    [
      "C2",
      "CCN("
    ],
    [
      "cn",
      "c2"
    ],
    [
      "c2n",
      "cc("
    ],
    [
      "N=",
      "C(N)"
    ],
    [
      "=N",
      "\\"
    ],
    [
      "C1",
      "=C("
    ],
    [
      "P",
      "("
    ],
    [
      "=",
      "C(C)"
    ],
    [
      "c(",
      "C#N)"
    ],
    [
      "Br",
      ")cc1"
    ],
    [
      "3",
      "C)"
    ],
    [
      "CC(",
      "F)"
    ],
    [
      "c1(",
      "-c2"
    ],
    [
      "c1c2c(",
      "ccc1)"
    ],
    [
      "C(N",
      "3"
    ],
    [
      "Cl)",
      "c1)"
    ],
    [
      "c1cc",
      "(C)cc"
    ],
    [
      "c1",
      "nc(N"
    ],
    [
      "C=",
      "C("
    ],
    [
      "[C@H]1",
      "2"
    ],
    [
      "CN(",
      "C("
    ],
    [
      "c(",
      "O"
    ],
    [
      "C1",
      "(C)"
    ],
    [
      "c2c(",
      "Cl)"
    ],
    [
      "c1",
      "=O)"
    ],
    [
      "C",
      "c3ccc("
    ],
    [
      "OC)",
      "c2)"
    ],
    [
      "=O)",
      "o"
    ],
    [
      "C(=O)",
      "C)"
    ],
    [
      "c2ccc(",
      "N"
    ],
    [
      "c2ccccc2",
      ")cc1"
    ],
    [
      "C(F)",
      "("
    ],
    [
      "c2",
      ")cc"
    ],
    [
      "F)cc",
      "c1"
    ],
    [
      "Cl)cc",
      "2"
    ],
    [
      "[N+]",
      "(C)"
    ],
    [
      "n",
      "c2c("
    ],
    [
      "s",
      "3)"
    ],
    [
      "[C@@]1",
      "(C)"
    ],
    [
      "S(",
      "N)"
    ],
    [
      "cs",
      "2)"
    ],
    [
      "C(=O)",
      "C("
    ],
    [
      "n1",
      "c2c("
    ],
    [
      "C=",
      "C)"
    ],
    [
      "C3",
      "("
    ],
    [
      "c1c(",
      "Cl)"
    ],
    [
      "Br)",
      "c("
    ],
    [
      "n1",
      "cn"
    ],
    [
      "N",
      "CC"
    ],
    [
      "c1n",
      "cc"
    ],
    [
      "-",
      "c1ccccc1"
    ],
    [
      "[C@@]2",
      "("
    ],
    [
      "CCN",
      "(C)CC"
    ],
    [
      "c4ccc(",
      "F)cc"
    ],
    [
      "-",
      "c2cc"
    ],
    [
      "O)cc",
      "c1"
    ],
    [
      "[C@H]1",
      "("
    ],
    [
      "c1ccc(",
      "Cl)cc1)"
    ],
    [
      "C(",
      "C(=O)N"
    ],
    [
      "C(=N)",
      "N"
    ],
    [
      "F)cc",
      "c("
    ],
    [
      "C(F)(F)",
      "F)cc1"
    ],
    [
      "cc",
      "c3)"
    ],
    [
      "c1ccc(",
      "F)cc1"
    ],
    [
      "C(N",
      "CC"
    ],
    [
      "4)",
      "=O)"
    ],
    [
      "c1cn",
      "("
    ],
    [
      "CCOCC",
      "1)"
    ],
    [
      "c2",
      ")cc("
    ],
    [
      "c4ccc(",
      "Cl)cc"
    ],
    [
      "=",
      "C(N)"
    ],
    [
      "(O)",
      "=O)"
    ],
    [
      "c1n",
      "c2c("
    ],
    [
      "c3",
      "ncc"
    ],
    [
      "c4c(",
      "cccc4)"
    ],
    [
      "c3",
      "2)"
    ],
    [
      "CC",
      "[C@H]1"
    ],
    [
      "c12",
      "cc("
    ],
    [
      "C1",
      "CC1"
    ],
    [
      "cc",
      "(C)"
    ],
    [
      "c1(",
      "-c2ccc("
    ],
    [
      "[nH]",
      "c(=O)"
    ],
    [
      "c1)",
      "C"
    ],
    [
      "/C(=",
      "N\\"
    ],
    [
      "C)cc",
      "(C)"
    ],
    [
      "c3cc(",
      "Cl)cc"
    ],
    [
      "c1cccc2",
      "c1"
    ],
    [
      "C(",
      "/C=C/"
    ],
    [
      "cs",
      "1"
    ],
    [
      "C(N)",
      "=N)"
    ],
    [
      "c3",
      "o"
    ],
    [
      "[C@H](",
      "CO)"
    ],
    [
      "c(",
      "C(=O)N"
    ],
    [
      "C1",
      "C2"
    ],
    [
      "CC",
      "[C@@H]2"
    ],
    [
      "(F)",
      "F)"
    ],
    [
      "C(",
      "C(N"
    ],
    [
      "OCC",
      "O"
    ],
    [
      "c12",
      "ccccc1"
    ],
    [
      "[C@]1",
      "("
    ],
    [
      "c1",
      "2)"
    ],
    [
      "2)=O)",
      "c1"
    ],
    [
      "ccc(",
      "-"
    ],
    [
      "nc2",
      "c1"
    ],
    [
      "C3",
      "="
    ],
    [
      "CN",
      "(C)C)"
    ],
    [
      "CC(=O)",
      "N("
    ],
    [
      "CN1",
      "CCN("
    ],
    [
      "C=",
      "C1"
    ],
    [
      "CC",
      "[C@H]3"
    ],
    [
      "c2cc",
      "c1"
    ],
    [
      "N2",
      "CCCC"
    ],
    [
      "S",
      "C)"
    ],
    [
      "c2cc",
      "(C)cc"
    ],
    [
      "c(",
      "NC(=O)"
    ],
    [
      "CO",
      "c1ccccc1"
    ],
    [
      "[C@@H]1",
      "("
    ],
    [
      "cccc",
      "4"
    ],
    [
      "C",
      "c3c("
    ],
    [
      "[C@H](",
      "NC(=O)"
    ],
    [
      "c1ccc(",
      "O"
    ],
    [
      "OCC",
      "(=O)N"
    ],
    [
      "c2ccc(Cl)cc",
      "2"
    ],
    [
      "n2",
      ")ccc1"
    ],
    [
      "c2)",
      "C1"
    ],
    [
      "c2ccccc2)",
      "c1"
    ],
    [
      "CN1",
      "C(=O)"
    ],
    [
      "nc(N",
      "3"
    ],
    [
      "c(-",
      "c2ccc("
    ],
    [
      "Br",
      ")cc2)"
    ],
    [
      "c1",
      "o"
    ],
    [
      "C1CCCC",
      "C1)"
    ],
    [
      "C",
      "5)"
    ],
    [
      "c1cc(",
      "OC)c("
    ],
    [
      "N2",
      "CCOCC2)"
    ],
    [
      "c12c(",
      "cccc1)"
    ],
    [
      "c1n",
      "cc("
    ],
    [
      "CC",
      "C(O)"
    ],
    [
      "n",
      "3)cc"
    ],
    [
      "4)",
      "CC3)"
    ],
    [
      "c2ccncc",
      "2)"
    ],
    [
      "=",
      "C/"
    ],
    [
      "C(",
      "c1c("
    ],
    [
      "CO",
      "c1cccc("
    ],
    [
      "[n+]",
      "2"
    ],
    [
      "C(=N)",
      "N)"
    ],
    [
      "C(F)(F)F)",
      "c1"
    ],
    [
      "c1c(",
      "-c2"
    ],
    [
      "c1ccc(",
      "NC(=O)"
    ],
    [
      "c2)",
      "c("
    ],
    [
      "[nH]",
      "2)"
    ],
    [
      "F)cc",
      "(F)"
    ],
    [
      "[C@@H](",
      "CC"
    ],
    [
      "OC)",
      "c3)"
    ],
    [
      "O=",
      "S(=O)("
    ],
    [
      "c1ccccc1)",
      "=O)"
    ],
    [
      "CCCC",
      "C)"
    ],
    [
      "C2",
      "CCCC"
    ],
    [
      "c2)",
      "n1"
    ],
    [
      "CC2",
      ")ccc1"
    ],
    [
      "nn",
      "1)"
    ],
    [
      "[C@@H](",
      "N"
    ],
    [
      "C(=O)",
      "/C=C/"
    ],
    [
      "C3",
      "CCCCC3)"
    ],
    [
      "C(C)=",
      "C/"
    ],
    [
      "c(=O)",
      "o"
    ],
    [
      "2c(",
      "c1)"
    ],
    [
      "c5cccc",
      "c5)"
    ],
    [
      "CN",
      "4"
    ],
    [
      "CC2",
      "("
    ],
    [
      "c1ccc(",
      "-c2"
    ],
    [
      "c2",
      ")ccc("
    ],
    [
      "n",
      "n("
    ],
    [
      "NC(",
      "=N)"
    ],
    [
      "C2)",
      "c1"
    ],
    [
      "C",
      "n3"
    ],
    [
      "OCC",
      "OCC"
    ],
    [
      "O",
      "c2c("
    ],
    [
      "C(=O)",
      "O)cc"
    ],
    [
      "=",
      "C)"
    ],
    [
      "Br)",
      "c1"
    ],
    [
      "[N+](=O)[O-]",
      ")cc"
    ],
    [
      "c-",
      "2"
    ],
    [
      "c1cc(",
      "Cl)ccc1"
    ],
    [
      "CO",
      "c2ccc("
    ],
    [
      "c1cc(",
      "Cl)c("
    ],
    [
      "c1cc",
      "(C)"
    ],
    [
      "n",
      "c12"
    ],
    [
      "C#",
      "C"
    ],
    [
      "[C@@]1",
      "("
    ],
    [
      "C=",
      "C2"
    ],
    [
      "C(N",
      "C"
    ],
    [
      "c3ccccc3)",
      "=O)"
    ],
    [
      "C(=O)N",
      "c2ccc("
    ],
    [
      "c(-",
      "c3ccc("
    ],
    [
      "CCCC",
      "N)"
    ],
    [
      "(=O)",
      "=O)cc1"
    ],
    [
      "[C@]4",
      "(C)"
    ],
    [
      "CCCC",
      "1)"
    ],
    [
      "(C)",
      "(O)"
    ],
    [
      "n1",
      "cc"
    ],
    [
      "C(",
      "c2ccc("
    ],
    [
      "c2cccc",
      "n2)"
    ],
    [
      "C1",
      "CC"
    ],
    [
      "c3ccccc3",
      "2)"
    ],
    [
      "ncc",
      "3"
    ],
    [
      "CC",
      "5)"
    ],
    [
      "c3ccccc3",
      ")cc"
    ],
    [
      "[N+]([O-])",
      "=O)cc"
    ],
    [
      "C(=O)",
      "[C@H]("
    ],
    [
      "=",
      "S"
    ],
    [
      "c3",
      "4)"
    ],
    [
      "C1CCCC",
      "C1"
    ],
    [
      "CC",
      "C(=O)O)"
    ],
    [
      "C(=O)",
      "c1c("
    ],
    [
      "N2",
      "CCOCC"
    ],
    [
      "CC(=O)",
      "N1"
    ],
    [
      "n2",
      "cn"
    ],
    [
      "(C)C)",
      "=O)"
    ],
    [
      "c1cc(",
      "-c2"
    ],
    [
      "O",
      "C(C)=O)"
    ],
    [
      "c1ccccc1",
      "-"
    ],
    [
      "O",
      "[C@@H]2"
    ],
    [
      "c2cc(",
      "OC)cc"
    ],
    [
      "CC",
      "[C@@H]1"
    ],
    [
      "/C=C2",
      "\\"
    ],
    [
      "OC)c1",
      "OC"
    ],
    [
      "/C=",
      "C(/"
    ],
    [
      "[C@H](",
      "CC)"
    ],
    [
      "C",
      "=O)"
    ],
    [
      "CC(C)",
      "("
    ],
    [
      "CN2",
      "CCN("
    ],
    [
      "CCC2",
      "("
    ],
    [
      "c(=O)",
      "n2"
    ],
    [
      "N",
      "C(C)"
    ],
    [
      "C2)",
      "=O)"
    ],
    [
      "c4cccc",
      "("
    ],
    [
      "CC1)",
      "=O)"
    ],
    [
      "c3",
      "=O)"
    ],
    [
      "c3cc(",
      "-"
    ],
    [
      "F",
      "C(F)(F)"
    ],
    [
      "c3c(",
      "ccc("
    ],
    [
      "n",
      "n(-"
    ],
    [
      "cn",
      "c3)"
    ],
    [
      "c(",
      "OCC"
    ],
    [
      "3)cc",
      "("
    ],
    [
      "c1c2c(",
      "cc("
    ],
    [
      "CC",
      ")cc"
    ],
    [
      "[C@H](O)",
      "[C@@H](O)"
    ],
    [
      "c1ccc(",
      "OCC"
    ],
    [
      "P(O)",
      "(=O)"
    ],
    [
      "CC(",
      "CC("
    ],
    [
      "C(",
      "c1cc("
    ],
    [
      "c1ccc(",
      "F)cc1)"
    ],
    [
      "OCC",
      "1"
    ],
    [
      "nn",
      "3)"
    ],
    [
      "CCCC",
      "N"
    ],
    [
      "C)cc",
      "(C)cc"
    ],
    [
      "c2c(",
      "F)"
    ],
    [
      "c2n",
      "(C)"
    ],
    [
      "O",
      "[C@H]2"
    ],
    [
      "c3ccc4c(",
      "c3)"
    ],
    [
      "c3cccc",
      "c23)"
    ],
    [
      "c3cc",
      "ncc3)"
    ],
    [
      "CCCN",
      "3"
    ],
    [
      "CC",
      "[C@@H]3"
    ],
    [
      "OCO",
      "4)"
    ],
    [
      "CCCC",
      "C3"
    ],
    [
      "c(",
      "C(N"
    ],
    [
      "C2",
      "=O)cc1"
    ],
    [
      "c2cc(",
      "Cl)c("
    ],
    [
      "N2",
      "CCC("
    ],
    [
      "[C@H](",
      "N)"
    ],
    [
      "c(",
      "NC("
    ],
    [
      "c1ccc(",
      "OC)cc1"
    ],
    [
      "C)cc",
      "3"
    ],
    [
      "c(F)",
      "c1"
    ],
    [
      "[C@H]2",
      "O)"
    ],
    [
      "F)cc",
      "2"
    ],
    [
      "[C@]3",
      "("
    ],
    [
      "O",
      "C(C)(C)C)"
    ],
    [
      "S(=O)(C)",
      "=O)"
    ],
    [
      "n",
      "nc("
    ],
    [
      "Cl)cc",
      "3)"
    ],
    [
      "CC",
      "5"
    ],
    [
      "[C@]",
      "5"
    ],
    [
      "C",
      "OC)"
    ],
    [
      "C)cc",
      "2)=O)"
    ],
    [
      "C",
      "c2n"
    ],
    [
      "c1cc",
      "co"
    ],
    [
      "c2",
      "N"
    ],
    [
      "C(F)(F)F)cc",
      "2)"
    ],
    [
      "CCCC",
      "4)"
    ],
    [
      "o",
      "c1"
    ],
    [
      "N1",
      "CCC("
    ],
    [
      "c(-",
      "c3ccccc3)"
    ],
    [
      "c2",
      "c1cccc2"
    ],
    [
      "C(",
      "CO)"
    ],
    [
      "c2ccco",
      "2)"
    ],
    [
      "F)c(",
      "F)"
    ],
    [
      "[C@@]",
      "5"
    ],
    [
      ")cc1)",
      "=O"
    ],
    [
      "c1c(",
      "OC)ccc("
    ],
    [
      "c1ccc(",
      "OC)cc1)"
    ],
    [
      "c2cc(",
      "OC)c("
    ],
    [
      "CCC",
      "4"
    ],
    [
      "c(",
      "O)c("
    ],
    [
      "c3cccc",
      "4"
    ],
    [
      "CCOCC",
      "4)"
    ],
    [
      "c3ccccc3",
      ")cc2)"
    ],
    [
      "c2cc",
      "(C)"
    ],
    [
      "c1(",
      "NC(=O)"
    ],
    [
      "c12",
      "ccc("
    ],
    [
      "c(=O)",
      "n1"
    ],
    [
      "CN2",
      "C(=O)"
    ],
    [
      "c3c(",
      "Cl)"
    ],
    [
      "c3",
      "nn"
    ],
    [
      "C(C)(C)",
      "C"
    ],
    [
      "C(N",
      "c2ccc("
    ],
    [
      "C(",
      "S"
    ],
    [
      "CCCC",
      "(=O)"
    ],
    [
      "nc(",
      "O)"
    ],
    [
      "c3",
      ")cc2)"
    ],
    [
      "Cl)",
      "c2"
    ],
    [
      "OC)",
      "c1)"
    ],
    [
      "c1c(",
      "-c2ccc("
    ],
    [
      "c1(",
      "NC("
    ],
    [
      "ncc",
      "1)"
    ],
    [
      "c5",
      "cc"
    ],
    [
      "CC3)",
      "=O)"
    ],
    [
      "c3",
      "c2cccc"
    ],
    [
      "C(O)",
      "=O"
    ],
    [
      "C(=O)",
      "(N"
    ],
    [
      "Br",
      ")cc3)"
    ],
    [
      "C(",
      "OCC"
    ],
    [
      "c3cc",
      "co"
    ],
    [
      "CC=",
      "C(C)C)"
    ],
    [
      "c1c(",
      "=O)"
    ],
    [
      "C(=O)",
      "C"
    ],
    [
      "c1",
      "cs"
    ],
    [
      "c1ccc(",
      "C)cc1)"
    ],
    [
      "O",
      "[C@H](C)"
    ],
    [
      "CC",
      "OC"
    ],
    [
      "c3",
      "C)"
    ],
    [
      "Br",
      ")cc("
    ],
    [
      "CC",
      "OC)"
    ],
    [
      "CC(=O)",
      "N2"
    ],
    [
      "c2cccc",
      "(F)"
    ],
    [
      "c2c(",
      "c("
    ],
    [
      "[nH]",
      "c1"
    ],
    [
      "/",
      "c("
    ],
    [
      "c2ccc(",
      "OCC"
    ],
    [
      "-",
      "c3ccc("
    ],
    [
      "c(C)",
      "cc("
    ],
    [
      "n(",
      "CC)"
    ],
    [
      "Cl)",
      "=O)"
    ],
    [
      "c1ccccc1)",
      "=O"
    ],
    [
      "c3cc(",
      "OC)cc"
    ],
    [
      "n",
      "c3c("
    ],
    [
      "C1",
      "C"
    ],
    [
      "C(O)",
      "("
    ],
    [
      "N",
      "[C@@H]("
    ],
    [
      "Cl",
      "c1ccc("
    ],
    [
      "O",
      "C3"
    ],
    [
      "C(=O)",
      "C2"
    ],
    [
      "c1c(",
      "O)"
    ],
    [
      "cs",
      "3)"
    ],
    [
      "[n+]",
      "([O-])"
    ],
    [
      "CCCC",
      "C4)"
    ],
    [
      "c3ccc(Cl)cc",
      "3"
    ],
    [
      "[C@@]4",
      "(C)"
    ],
    [
      "c5",
      "cc("
    ],
    [
      "Cc1",
      "c[nH]"
    ],
    [
      "c2c(",
      "O)"
    ],
    [
      "c2n",
      "c1"
    ],
    [
      "C)",
      "cc("
    ],
    [
      "-",
      "c2cccc("
    ],
    [
      "c12c(",
      "cc("
    ],
    [
      "/N=",
      "C(/"
    ],
    [
      "NC(=S)",
      "N"
    ],
    [
      "c(O)",
      "c1"
    ],
    [
      "[C@@H](O",
      "C(C)=O)"
    ],
    [
      "[C@@H](",
      "OC(=O)"
    ],
    [
      "CC2)",
      "C1"
    ],
    [
      "c1",
      "c[nH]"
    ],
    [
      "S",
      "2"
    ],
    [
      "[C@@H](",
      "OC)"
    ],
    [
      "N",
      "S(=O)("
    ],
    [
      "CS",
      "c1n"
    ],
    [
      "n(-",
      "c2ccccc2)"
    ],
    [
      "C[C@H](",
      "N)"
    ],
    [
      "c3cc",
      "4"
    ],
    [
      "c4ccc(",
      "OC)cc"
    ],
    [
      "N",
      "S("
    ],
    [
      "[nH]",
      "3)"
    ],
    [
      "n2",
      ")ccc("
    ],
    [
      "c3c(",
      "=O)"
    ],
    [
      "C1",
      "\\"
    ],
    [
      "[C@@H](O)",
      "[C@H]("
    ],
    [
      "N(CC)",
      "CC)"
    ],
    [
      "c1cn",
      "c("
    ],
    [
      "c3",
      "nc(-"
    ],
    [
      "c1c(",
      "NC(=O)"
    ],
    [
      "n1",
      "c(N"
    ],
    [
      "NC(",
      "[C@H]("
    ],
    [
      "CC",
      "C(=O)"
    ],
    [
      "c2c(",
      "OC)"
    ],
    [
      "c1c(",
      "OC)"
    ],
    [
      "C)",
      "C)"
    ],
    [
      "C)cc",
      "4)"
    ],
    [
      "-",
      "c3ccccc3)"
    ],
    [
      "c2cc(",
      "F)cc"
    ],
    [
      "C4",
      "CC4)"
    ],
    [
      "c3cc",
      "(C)cc"
    ],
    [
      "N(C)",
      "C(=O)"
    ],
    [
      "ccc(",
      "C)"
    ],
    [
      "[C@@]3",
      "("
    ],
    [
      "CS",
      "c2n"
    ],
    [
      "n2)",
      "CC1"
    ],
    [
      "[C@H](O",
      "C(C)=O)"
    ],
    [
      "c1ccc(",
      "C)cc1"
    ],
    [
      "CN(",
      "CC)"
    ],
    [
      "nc1",
      "-"
    ],
    [
      "c2",
      "nc(C)"
    ],
    [
      "o",
      "1)"
    ],
    [
      "c1cc",
      "cnc1"
    ],
    [
      "CCCCCCCC",
      "CCCCCCCC"
    ],
    [
      "C=",
      "C"
    ],
    [
      "c1cc(",
      "NC(=O)"
    ],
    [
      "C=",
      "C(C)C)"
    ],
    [
      "C(F)",
      "F)"
    ],
    [
      "O",
      "4)"
    ],
    [
      "C(",
      "CN"
    ],
    [
      "c2",
      "c3ccccc3"
    ],
    [
      "C[C@H](",
      "NC(=O)"
    ],
    [
      "c2",
      "c[nH]"
    ],
    [
      "C(",
      "OC"
    ],
    [
      "cccc",
      "2)=O)"
    ],
    [
      "OCC",
      "2"
    ],
    [
      "C(=S)",
      "N"
    ],
    [
      "CC1",
      "("
    ],
    [
      "c1c(",
      "NC("
    ],
    [
      "CC",
      "N)"
    ],
    [
      "cc",
      "3c("
    ],
    [
      "c2c(",
      "N)"
    ],
    [
      "cs",
      "1)"
    ],
    [
      "c1c(",
      "F)"
    ],
    [
      "c3c(",
      "F)"
    ],
    [
      "c1cccc",
      "(F)"
    ],
    [
      "CC(=O)",
      "O"
    ],
    [
      "C(=O)N",
      "C("
    ],
    [
      "C(N",
      "c1ccc("
    ],
    [
      "c2cccc",
      "(C)"
    ],
    [
      "C(F)(F)F)cc",
      "("
    ],
    [
      "Br",
      ")cc1)"
    ],
    [
      "S",
      "CC(=O)N"
    ],
    [
      "n2",
      ")cc"
    ],
    [
      "O[C@H](CO)",
      "[C@@H](O)[C@H](O)"
    ],
    [
      "n(-",
      "c3ccccc3)"
    ],
    [
      "c3cc4c(",
      "cc3)"
    ],
    [
      "C2",
      "3"
    ],
    [
      "c2ccc(",
      "N3"
    ],
    [
      "/C=C2",
      "/"
    ],
    [
      "c3cccc",
      "n3)"
    ],
    [
      "CCCN",
      ")"
    ],
    [
      "C(",
      "Cl)"
    ],
    [
      "N",
      "[C@H]("
    ],
    [
      "n1",
      "2"
    ],
    [
      "CCO",
      "c1ccc("
    ],
    [
      "c2cccn",
      "c2)"
    ],
    [
      "S(=O)(=O)",
      "C)"
    ],
    [
      "c1c(",
      "Cl)cc("
    ],
    [
      "c1s",
      "c("
    ],
    [
      "[C@@H](",
      "CO"
    ],
    [
      "s",
      "c2"
    ],
    [
      "C1",
      "CC1)"
    ],
    [
      "[N+](=O)[O-]",
      ")cc1"
    ],
    [
      "CC",
      "c1ccc("
    ],
    [
      "cn",
      "c1)"
    ],
    [
      "F",
      "C(F)("
    ],
    [
      "CC2)",
      "c("
    ],
    [
      "c1(",
      "-c2n"
    ],
    [
      "C(",
      "C#N)"
    ],
    [
      "o",
      "3)"
    ],
    [
      "c2ccc(",
      "OC)cc"
    ],
    [
      "CC2",
      ")cc"
    ],
    [
      "CCC)",
      "=O)"
    ],
    [
      "c1(",
      "C(N"
    ],
    [
      "c2",
